Revit 2027 API
Wave.WaveColor2 Property
 The property labeled "Color 2" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaveColor2 { get; }
Public Shared ReadOnly Property WaveColor2 As String
	Get
public:
static property String^ WaveColor2 {
	String^ get ();
}
static member WaveColor2 : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Wave Class
Autodesk.Revit.DB.Visual Namespace